//Напишите программу , которая принимает на входе три числа и выдает максимальное из трех чисел.
int [] nums = {1, 3, 5};
int max = nums.Max();
Console.WriteLine (max);
