// Задача 1: Напишите программу, которая на входе принимает два числа и выводит, кокое число болшее, а которое меньшее.
int [] nums = {0, 1, 2, 3, 5};
int max = nums.Max();
Console.WriteLine (max);

