// Задача 1: Напишите программу, которая на входе принимает два числа и выводит, кокое число болшее, а которое меньшее.
int [] nums = {3, 5};
int max = nums.Max();
Console.WriteLine (max);

// Вариант 2 

int a = (8);
int b = (5);
if (a>b)
{
    Console.WriteLine(a);
}
else
{
     Console.WriteLine(b);
}
