//Напишите метод, который принимает на вход два числа (A и B) и возводит число A в натуральную степень B.
int a = (5);
int b=(2);
Console.WriteLine("5^2="+Math.Pow(a,b));