// Напишите программу, которая на вход принимает число и выдает, является ли число четным.
int x=(5);
x = Console.Read();
if ((x % 2) == 0)
{
    Console.WriteLine("chentoe");
}
else
{
    Console.WriteLine("nechentoe");

}